//Console.WriteLine("Hello, World!");

// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// int SecondNum(int num) 
// {
//     int ten = num / 10;
//     int result = ten % 10;

//     return result;
// }

// int getNum = Convert.ToInt32(Console.ReadLine());
// int newNum = SecondNum(getNum);

// Console.WriteLine(newNum);

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.




// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет